<a href="https://colab.research.google.com/github/jayac251/Machine_Learning/blob/main/Dataframe_Filter_by_using_isin().ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [3]:
import pandas as pd

# mounting google drive
from google.colab import drive
drive.mount("/gdrive")

df = pd.read_csv("/gdrive/My Drive/Colab Notebooks/employees.csv")
df.head()

Drive already mounted at /gdrive; to attempt to forcibly remount, call drive.mount("/gdrive", force_remount=True).

  First Name  Gender Start Date  ... Bonus %  Senior Management             Team
0    Douglas    Male   8/6/1993  ...   6.945               True        Marketing
1     Thomas    Male  3/31/1996  ...   4.170               True              NaN
2      Maria  Female  4/23/1993  ...  11.858              False          Finance
3      Jerry    Male   3/4/2005  ...   9.340               True          Finance
4      Larry    Male  1/24/1998  ...   1.389               True  Client Services

[5 rows x 8 columns]

#**Data Cleansing**

In [4]:
#Convert Start date, Last login time to date time object

df['Start Date'] = pd.to_datetime(df['Start Date'])

df['Last Login Time'] = pd.to_datetime(df['Last Login Time'])




# Convert Sr.mgmt to Boolean object

df['Senior Management'] = df['Senior Management'].astype('bool')




#Convert Gender to category object
df['Gender'] = df['Gender'].astype('category')

#**isin() method**

In [5]:
mask1 = df['Team'] =='Legal'
mask2 = df['Team'] =='Sales'
mask3 = df['Team'] =='Product'

In [10]:
df[mask1 | mask2 | mask3]  # <---- this can be implemented as below using isin

filter = df['Team'].isin(['Legal','Sales','Marketing'])

df[filter]

    First Name  Gender Start Date  ... Bonus %  Senior Management       Team
0      Douglas    Male 1993-08-06  ...   6.945               True  Marketing
5       Dennis    Male 1987-04-18  ...  10.125              False      Legal
11       Julie  Female 1997-10-26  ...  12.637               True      Legal
13        Gary    Male 2008-01-27  ...   5.831              False      Sales
20        Lois     NaN 1995-04-22  ...   4.934               True      Legal
..         ...     ...        ...  ...     ...                ...        ...
986      Donna  Female 1982-11-26  ...  17.999              False  Marketing
989     Justin     NaN 1991-02-10  ...   3.794              False      Legal
991       Rose  Female 2002-08-25  ...  11.051               True  Marketing
994     George    Male 2013-06-21  ...   4.479               True  Marketing
999     Albert    Male 2012-05-15  ...  10.169               True      Sales

[280 rows x 8 columns]